# Shell enhancements
brew "zsh"
brew "oh-my-posh"
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "zoxide"
brew "direnv"
brew "fd"

# Development tools
brew "git"
brew "gh"
brew "jq"
brew "yq"
brew "httpie"
brew "tldr"
brew "htop"
brew "btop"

# Python development
brew "python@3.12"
brew "pipx"
brew "ruff"

# Docker tools
brew "lazydocker"
brew "dive"
brew "docker-compose"

# Node.js
brew "node"
brew "nvm"